# Làm sạch dữ liệu cơ bản

In [3]:
import pandas as pd

## 1. Tạo dữ liệu

In [ ]:
data = {
    "id" : [1, 2, 3, 4, 5],
    "name" : ["Anh", "em", "Phong", "Phu", None],
    "age" : [15, 14, 18, 28, 50],
    "email" : ["Anh@vlu.edu.vn", "em@gmail.com", "Phong@vanlanguni.vn", "Phu@yahoo.com", None],
    "salary" : [None, 70000, 10000, 25000, 15000]
}
df = pd.DataFrame(data)

print(df)

   id   name  age                email   salary
0   1    Anh   15       Anh@vlu.edu.vn      NaN
1   2     em   14         em@gmail.com  70000.0
2   3  Phong   18  Phong@vanlanguni.vn  10000.0
3   4    Phu   28        Phu@yahoo.com  25000.0
4   5   None   50                 None  15000.0

In [7]:
# lấy ra 5 dòng đầu tiên

df.head()

   id   name  age                email   salary
0   1    Anh   15       Anh@vlu.edu.vn      NaN
1   2     em   14         em@gmail.com  70000.0
2   3  Phong   18  Phong@vanlanguni.vn  10000.0
3   4    Phu   28        Phu@yahoo.com  25000.0
4   5   None   50                 None  15000.0

In [8]:
# kiểm tra dữ liệu thiếu

df.isnull().sum()

id        0
name      1
age       0
email     1
salary    1
dtype: int64

In [ ]:
# Điền giá trị thiếu bằng giá trị trung bình cho cột salary

df["salary"].fillna(df["salary"].mean(), inplace = True)

In [ ]:
# Điền giá trị thiếu bằng Unknow cho cột "Name" và cột "email"
df["name"].fillna("Unknow", inplace = True)
df["email"].fillna("Unknow", inplace = True)

In [11]:
# Kiểm tra lại dữ liệu thiếu
df.isnull().sum()

id        0
name      0
age       0
email     0
salary    0
dtype: int64

In [12]:
df.head()

   id    name  age                email   salary
0   1     Anh   15       Anh@vlu.edu.vn  30000.0
1   2      em   14         em@gmail.com  70000.0
2   3   Phong   18  Phong@vanlanguni.vn  10000.0
3   4     Phu   28        Phu@yahoo.com  25000.0
4   5  Unknow   50               Unknow  15000.0

In [13]:
# Loại bỏ dữ liệu trùng lặp
df.drop_duplicates(inplace = True)
df

   id    name  age                email   salary
0   1     Anh   15       Anh@vlu.edu.vn  30000.0
1   2      em   14         em@gmail.com  70000.0
2   3   Phong   18  Phong@vanlanguni.vn  10000.0
3   4     Phu   28        Phu@yahoo.com  25000.0
4   5  Unknow   50               Unknow  15000.0

In [14]:
# Chuẩn hóa cột name bằng cách viết hoa chữ cái đầu
df["name"] = df["name"].str.title()

In [15]:
# Chuẩn hóa cột email bằng cách chuyển về chữ thường
df["email"] = df["email"].str.lower()


df

   id    name  age                email   salary
0   1     Anh   15       anh@vlu.edu.vn  30000.0
1   2      Em   14         em@gmail.com  70000.0
2   3   Phong   18  phong@vanlanguni.vn  10000.0
3   4     Phu   28        phu@yahoo.com  25000.0
4   5  Unknow   50               unknow  15000.0

In [16]:
# Lưu dữ liệu đã làm sạch

df.to_csv("Dulieulamsach.csv", index = False)

# Bài Tập Về Nhà

### Cho dữ liệu dirty_data.csv
1. Kiểm tra dữ liệu bị thiếu:
    - Kiểm tra các cột có dữ liệu thiếu
    - Điền giá trị phù hợp hoặc loại bỏ các hàng có quá nhiều dữ liệu thiếu
2. Phát hiện và sửa lỗi dữ liệu bất thường:
    - Tìm các giá trị bất thường trong cột tuổi có thể là âm hoặc quá lớn
    - Kiểm tra cột thu nhập (income) để phatsbhienej dữ liệu bị sai
3. Chuyển hóa dạng dữ liệu
    - Chuyển đổi cột ngày sinh về dạng chuẩn yyyy-mm-dd
    - Chuyển hóa dữ liệu trong cột giới tính (gender) để chỉ có 2 giới tính hợp lệ là "Male" và "Female"
4. Xóa bỏ dữ liệu trùng lặp
    - Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
5. Xuất dữ liệu sạch:
    - Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv

In [8]:
import pandas as pd
from io import StringIO

In [17]:
# Đọc dữ liệu
df = pd.read_csv(StringIO(data))

# 1a. Kiểm tra dữ liệu thiếu
print("Dữ liệu thiếu trong từng cột:")
print(df.isnull().sum())

# 1b. Xử lý dữ liệu thiếu
# - Chuyển 'income' sang số, ép giá trị không hợp lệ thành NaN
df['income'] = pd.to_numeric(df['income'], errors='coerce')
# - Điền NaN trong 'income' bằng 0
df['income'] = df['income'].fillna(0)
# - Để xử lý 'age' sau khi sửa bất thường ở câu 2
print("\nDataFrame sau khi xử lý dữ liệu thiếu ban đầu:")
print(df)

Dữ liệu thiếu trong từng cột:
customer_id    0
name           0
age            1
gender         0
dob            0
income         1
email          0
dtype: int64

DataFrame sau khi xử lý dữ liệu thiếu ban đầu:
    customer_id          name    age   gender         dob  income  \
0           101  Nguyen Van A   25.0     Male  1998-05-22  1200.0
1           102    Tran Thi B   42.0   Female  1981-07-14  4500.0
2           103      Le Van C   -5.0     male  12/03/1995  3200.0
3           104  Hoang Minh D  150.0        F  1980/08/25  -500.0
4           105    Pham Thi E   30.0      Fem  1993-09-30     0.0
5           106  Nguyen Van F    NaN        M  1996-11-02  2500.0
6           107     Bui Thi G   29.0   Female  1994/06/15  3800.0
7           108    Dang Van H   40.0        f  1990-01-29  4200.0
8           109      Vo Thi I   27.0     Male  1995-04-10  3900.0
9           110    Phan Van J   22.0  unknown  1999-12-20     0.0
10          110    Phan Van J   22.0     Male  1999-12-20  3900.0

            email
0   a@example.com
1   b@example.com
2   c@example.com
3   d@example.com
4   e@example.com
5   f@example.com
6   g@example.com
7   h@example.com
8   i@example.com
9   j@example.com
10  j@example.com

In [18]:
# 2. Phát hiện và sửa lỗi bất thường
# - Age âm (<0) hoặc quá lớn (>100): thay bằng NaN
df.loc[(df['age'] < 0) | (df['age'] > 100), 'age'] = None
# - Điền NaN trong 'age' bằng trung bình của các giá trị hợp lệ
age_mean = df['age'].mean()
df['age'] = df['age'].fillna(age_mean)

# - Income âm: thay bằng 0
df.loc[df['income'] < 0, 'income'] = 0

print("\nDataFrame sau khi sửa lỗi bất thường:")
print(df)

DataFrame sau khi sửa lỗi bất thường:
    customer_id          name     age   gender         dob  income  \
0           101  Nguyen Van A  25.000     Male  1998-05-22  1200.0
1           102    Tran Thi B  42.000   Female  1981-07-14  4500.0
2           103      Le Van C  29.625     male  12/03/1995  3200.0
3           104  Hoang Minh D  29.625        F  1980/08/25     0.0
4           105    Pham Thi E  30.000      Fem  1993-09-30     0.0
5           106  Nguyen Van F  29.625        M  1996-11-02  2500.0
6           107     Bui Thi G  29.000   Female  1994/06/15  3800.0
7           108    Dang Van H  40.000        f  1990-01-29  4200.0
8           109      Vo Thi I  27.000     Male  1995-04-10  3900.0
9           110    Phan Van J  22.000  unknown  1999-12-20     0.0
10          110    Phan Van J  22.000     Male  1999-12-20  3900.0

            email
0   a@example.com
1   b@example.com
2   c@example.com
3   d@example.com
4   e@example.com
5   f@example.com
6   g@example.com
7   h@example.com
8   i@example.com
9   j@example.com
10  j@example.com

In [19]:
# 3. Chuyển hóa dữ liệu
# - Chuẩn hóa ngày sinh
df['dob'] = pd.to_datetime(df['dob'], errors='coerce').dt.strftime('%Y-%m-%d')

# - Chuẩn hóa gender
def standardize_gender(g):
    g = str(g).lower()
    if g in ['m', 'male']:
        return 'Male'
    elif g in ['f', 'female', 'fem']:
        return 'Female'
    return None

df['gender'] = df['gender'].apply(standardize_gender)

print("\nDataFrame sau khi chuyển hóa dữ liệu:")
print(df)

DataFrame sau khi chuyển hóa dữ liệu:
    customer_id          name     age  gender         dob  income  \
0           101  Nguyen Van A  25.000    Male  1998-05-22  1200.0
1           102    Tran Thi B  42.000  Female  1981-07-14  4500.0
2           103      Le Van C  29.625    Male         NaN  3200.0
3           104  Hoang Minh D  29.625  Female         NaN     0.0
4           105    Pham Thi E  30.000  Female  1993-09-30     0.0
5           106  Nguyen Van F  29.625    Male  1996-11-02  2500.0
6           107     Bui Thi G  29.000  Female         NaN  3800.0
7           108    Dang Van H  40.000  Female  1990-01-29  4200.0
8           109      Vo Thi I  27.000    Male  1995-04-10  3900.0
9           110    Phan Van J  22.000    None  1999-12-20     0.0
10          110    Phan Van J  22.000    Male  1999-12-20  3900.0

            email
0   a@example.com
1   b@example.com
2   c@example.com
3   d@example.com
4   e@example.com
5   f@example.com
6   g@example.com
7   h@example.com
8   i@example.com
9   j@example.com
10  j@example.com

In [20]:
# 4. Xóa trùng lặp
df_cleaned = df.drop_duplicates(subset=['customer_id', 'name'], keep='last')

print("\nDataFrame sau khi xóa trùng lặp:")
print(df_cleaned)

DataFrame sau khi xóa trùng lặp:
    customer_id          name     age  gender         dob  income  \
0           101  Nguyen Van A  25.000    Male  1998-05-22  1200.0
1           102    Tran Thi B  42.000  Female  1981-07-14  4500.0
2           103      Le Van C  29.625    Male         NaN  3200.0
3           104  Hoang Minh D  29.625  Female         NaN     0.0
4           105    Pham Thi E  30.000  Female  1993-09-30     0.0
5           106  Nguyen Van F  29.625    Male  1996-11-02  2500.0
6           107     Bui Thi G  29.000  Female         NaN  3800.0
7           108    Dang Van H  40.000  Female  1990-01-29  4200.0
8           109      Vo Thi I  27.000    Male  1995-04-10  3900.0
10          110    Phan Van J  22.000    Male  1999-12-20  3900.0

            email
0   a@example.com
1   b@example.com
2   c@example.com
3   d@example.com
4   e@example.com
5   f@example.com
6   g@example.com
7   h@example.com
8   i@example.com
10  j@example.com

In [21]:
# 5. Xuất dữ liệu sạch
df_cleaned.to_csv('clean_data.csv', index=False)
print("\nĐã lưu dữ liệu sạch vào clean_data.csv")
print(df_cleaned)

Đã lưu dữ liệu sạch vào clean_data.csv
    customer_id          name     age  gender         dob  income  \
0           101  Nguyen Van A  25.000    Male  1998-05-22  1200.0
1           102    Tran Thi B  42.000  Female  1981-07-14  4500.0
2           103      Le Van C  29.625    Male         NaN  3200.0
3           104  Hoang Minh D  29.625  Female         NaN     0.0
4           105    Pham Thi E  30.000  Female  1993-09-30     0.0
5           106  Nguyen Van F  29.625    Male  1996-11-02  2500.0
6           107     Bui Thi G  29.000  Female         NaN  3800.0
7           108    Dang Van H  40.000  Female  1990-01-29  4200.0
8           109      Vo Thi I  27.000    Male  1995-04-10  3900.0
10          110    Phan Van J  22.000    Male  1999-12-20  3900.0

            email
0   a@example.com
1   b@example.com
2   c@example.com
3   d@example.com
4   e@example.com
5   f@example.com
6   g@example.com
7   h@example.com
8   i@example.com
10  j@example.com